In [3]:
import pandas as pd
df = pd.read_csv('/kaggle/input/employee-performance-and-salary-dataset/Employe_Performance_dataset.csv')

In [4]:
print("# Question 1:")
print(df.head(10))

# Question 1:
   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15
5   6         Ashley Howe   29  Female         HR    2591   2016-06-24
6   7         David Olson   39  Female      Sales    6826   2023-05-11
7   8        Amanda Baker   52   Other         HR    6285   2015-04-01
8   9       Jeremy Wright   63  Female      Sales    9862   2024-02-07
9  10      Brian Faulkner   30    Male         IT    8202   2018-05-26

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening
5                1.0           6    Active      Chicago  Evening
6                NaN           4    Active     New York    Night
7                NaN           8  Inactive      Chicago  Evening
8                NaN           3  Inactive     New York    Night
9                1.0           9    Active  Los Angeles  Morning

In [5]:
# Question 2: Column names and data types
print("# Question 2:")
print(df.dtypes)

# Question 2:
ID                     int64
Name                  object
Age                    int64
Gender                object
Department            object
Salary                 int64
Joining Date          object
Performance Score    float64
Experience             int64
Status                object
Location              object
Session               object
dtype: object

In [6]:
# Question 3: Number of rows and columns
print("# Question 3:")
print(df.shape)

# Question 3:
(1000, 12)

In [7]:
# Question 4: Select Name, Age, Salary columns
print("# Question 4:")
print(df[['Name', 'Age', 'Salary']])

# Question 4:
                   Name  Age  Salary
0          Cory Escobar   48    5641
1       Timothy Sanchez   25    4249
2          Chad Nichols   57    3058
3    Christine Williams   58    5895
4          Amber Harris   35    4317
..                  ...  ...     ...
995       Pamela Reeves   49    7652
996        Todd Johnson   29    6754
997     Michael Sanchez   18    5278
998       Ashley Taylor   51    5437
999         Shawn Scott   45    7364

[1000 rows x 3 columns]

In [8]:
# Question 5: Select first 5 rows with iloc
print("# Question 5:")
print(df.iloc[:5])

# Question 5:
   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening

In [9]:
# Question 6: Rows where Department is 'Sales'
print("# Question 6:")
print(df.loc[df['Department'] == 'Sales'])

# Question 6:
      ID             Name  Age  Gender Department  Salary Joining Date  \
1      2  Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
10    11      Nicole Bell   42  Female      Sales    5336   2015-01-28
..   ...              ...  ...     ...        ...     ...          ...
991  992  William Schultz   23   Other      Sales    4311   2019-08-17
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
995  996    Pamela Reeves   49  Female      Sales    7652   2024-06-23
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
997  998  Michael Sanchez   18    Male      Sales    5278   2023-07-05

     Performance Score  Experience    Status     Location  Session
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
10                 3.0           7    Active  Los Angeles  Evening
..                 ...         ...       ...          ...      ...
991                NaN          10  Inactive  Los Angeles  Evening
992                NaN           8  Inactive     New York  Morning
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning

[338 rows x 12 columns]

In [10]:
# Question 7: Rows with Salary > 8000 and Status is 'Active'
print("# Question 7:")
print(df[(df['Salary'] > 8000) & (df['Status'] == 'Active')])

# Question 7:
      ID             Name  Age  Gender Department  Salary Joining Date  \
9     10   Brian Faulkner   30    Male         IT    8202   2018-05-26
24    25    Tracy Carlson   21    Male         HR    9275   2022-04-09
38    39     Jordan Scott   33   Other      Sales    8678   2016-05-15
39    40      Lisa Wagner   36    Male         HR    8870   2024-08-12
60    61   Andrew Shannon   51   Other      Sales    8544   2020-02-08
..   ...              ...  ...     ...        ...     ...          ...
976  977    Kimberly Ross   19    Male      Sales    9331   2018-07-03
982  983    Stephen Ponce   46   Other      Sales    8696   2022-10-14
986  987  Melissa Bradley   39  Female         IT    9618   2015-07-05
988  989   Hannah Hickman   36  Female         IT    9118   2022-07-02
989  990    Shannon Meyer   18   Other         HR    9985   2022-11-05

     Performance Score  Experience  Status     Location  Session
9                  1.0           9  Active  Los Angeles  Morning
24                 4.0          12  Active     New York  Morning
38                 5.0           9  Active  Los Angeles  Evening
39                 4.0          17  Active  Los Angeles  Evening
60                 NaN           6  Active     New York  Evening
..                 ...         ...     ...          ...      ...
976                5.0          12  Active     New York  Morning
982                4.0           1  Active     New York  Evening
986                1.0          13  Active     New York  Morning
988                5.0           5  Active     New York    Night
989                4.0          18  Active      Chicago    Night

[112 rows x 12 columns]

In [11]:
# Task 8: Select rows where Experience > 5 years and Performance Score >= 4
print("\n# Task 8:")
print(df[(df['Experience'] > 5) & (df['Performance Score'] >= 4)])

# Task 8:
      ID                Name  Age  Gender Department  Salary Joining Date  \
4      5        Amber Harris   35   Other         IT    4317   2020-02-15
11    12   Rodney Richardson   60   Other         HR    6908   2015-03-14
17    18  Jacqueline Randall   31  Female         HR    3519   2018-05-18
18    19      Nancy Stephens   38    Male         HR    9061   2017-07-16
24    25       Tracy Carlson   21    Male         HR    9275   2022-04-09
..   ...                 ...  ...     ...        ...     ...          ...
978  979         Michael Lee   18  Female         IT    6086   2019-05-30
989  990       Shannon Meyer   18   Other         HR    9985   2022-11-05
990  991        Amy Johnston   53  Female         HR    3991   2024-09-03
993  994       Brandon Bruce   31  Female         HR    3371   2018-09-25
998  999       Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session
4                  5.0          16  Inactive     New York  Evening
11                 4.0          19    Active      Chicago    Night
17                 4.0           6    Active     New York  Morning
18                 5.0          16  Inactive      Chicago    Night
24                 4.0          12    Active     New York  Morning
..                 ...         ...       ...          ...      ...
978                4.0           7  Inactive  Los Angeles  Evening
989                4.0          18    Active      Chicago    Night
990                4.0           8    Active      Chicago  Morning
993                5.0          12  Inactive      Chicago    Night
998                4.0           9  Inactive  Los Angeles  Evening

[137 rows x 12 columns]

In [12]:
# Task 9: Select every alternate row using slicing with `iloc`
print("\n# Task 9: Every alternate row")
print(df.iloc[::2])

# Task 9: Every alternate row
      ID             Name  Age  Gender Department  Salary Joining Date  \
0      1     Cory Escobar   48  Female         HR    5641   2015-05-03
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
4      5     Amber Harris   35   Other         IT    4317   2020-02-15
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
..   ...              ...  ...     ...        ...     ...          ...
990  991     Amy Johnston   53  Female         HR    3991   2024-09-03
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
994  995  Rachel Phillips   22    Male         IT    3096   2018-10-27
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
998  999    Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
2                  NaN           1  Inactive     New York  Morning
4                  5.0          16  Inactive     New York  Evening
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
..                 ...         ...       ...          ...      ...
990                4.0           8    Active      Chicago  Morning
992                NaN           8  Inactive     New York  Morning
994                2.0           7  Inactive      Chicago  Evening
996                NaN          12  Inactive     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening

[500 rows x 12 columns]

In [13]:
# Task 10: Rows where Department is 'Sales' and Salary is in the top 10%
top_10_percent_salary = df['Salary'].quantile(0.9)
print("\n# Task 10: Rows where Department is 'Sales' and Salary in top 10%")
print(df[(df['Department'] == 'Sales') & (df['Salary'] >= top_10_percent_salary)])

# Task 10: Rows where Department is 'Sales' and Salary in top 10%
      ID                     Name  Age  Gender Department  Salary  \
8      9            Jeremy Wright   63  Female      Sales    9862
22    23             Bryce Carter   35  Female      Sales    9598
29    30            Rachel Ramsey   22    Male      Sales    9661
215  216               Sara Jones   50  Female      Sales    9377
228  229          Christie Warren   51  Female      Sales    9139
239  240      Christina Gutierrez   37    Male      Sales    9356
250  251           Joshua Bullock   38    Male      Sales    9924
263  264          Gabriela Wilson   40   Other      Sales    9455
275  276          Harry Alexander   22    Male      Sales    9749
299  300              Terry Smith   38  Female      Sales    9375
379  380                Dustin Le   29    Male      Sales    9726
381  382           David Marshall   43   Other      Sales    9269
405  406            Heather Scott   57    Male      Sales    9505
442  443          Kimberly Sparks   26   Other      Sales    9146
491  492  Dr. Jacob Castaneda DVM   53   Other      Sales    9181
516  517           Christina Lowe   35  Female      Sales    9630
552  553          Amanda Griffith   26    Male      Sales    9704
591  592          Jonathan Rangel   49   Other      Sales    9323
594  595           Michelle Smith   35   Other      Sales    9906
629  630           Patricia Scott   52   Other      Sales    9364
742  743           Timothy Guzman   41  Female      Sales    9409
756  757              James James   38    Male      Sales    9666
758  759          Matthew Roberts   53    Male      Sales    9917
778  779             David Nelson   39   Other      Sales    9653
796  797            Jacob Shannon   35   Other      Sales    9926
844  845             Gerald Cooke   33   Other      Sales    9693
898  899           Tiffany Jordan   44    Male      Sales    9819
903  904             Leslie Mason   42   Other      Sales    9658
932  933             Kristin Cole   50    Male      Sales    9616
937  938            Gary Mitchell   52  Female      Sales    9963
976  977            Kimberly Ross   19    Male      Sales    9331

    Joining Date  Performance Score  Experience    Status     Location  \
8     2024-02-07                NaN           3  Inactive     New York
22    2015-12-16                4.0           4  Inactive     New York
29    2016-08-18                2.0          17  Inactive      Chicago
215   2019-10-16                NaN           3    Active  Los Angeles
228   2020-08-16                5.0           1    Active      Chicago
239   2018-01-02                3.0           3    Active      Chicago
250   2019-01-10                4.0          20  Inactive      Chicago
263   2023-11-19                1.0          14    Active  Los Angeles
275   2019-05-15                NaN           5    Active  Los Angeles
299   2022-12-23                NaN           2  Inactive     New York
379   2015-04-13                1.0           2  Inactive      Chicago
381   2018-10-05                2.0          13  Inactive  Los Angeles
405   2024-08-18                3.0           6  Inactive     New York
442   2024-07-29                3.0           3  Inactive     New York
491   2024-02-17                5.0           1  Inactive  Los Angeles
516   2018-07-03                NaN           1    Active  Los Angeles
552   2019-05-30                NaN           9    Active     New York
591   2021-01-19                NaN          18  Inactive      Chicago
594   2018-12-18                NaN           9    Active  Los Angeles
629   2019-11-05                NaN           5    Active     New York
742   2023-09-17                NaN          16  Inactive     New York
756   2016-04-14                NaN          15    Active  Los Angeles
758   2017-07-07                1.0          16    Active  Los Angeles
778   2021-08-08                NaN          19  Inactive     New York
796   2016-09-04                NaN           7    Active      Chicago
844   2017-08-29                NaN          17  Inactive     New York
898   2022-07-15                NaN          13    Active     New York
903   2019-10-31                1.0          14  Inactive     New York
932   2017-02-03                2.0          13  Inactive  Los Angeles
937   2016-09-22                5.0          20  Inactive  Los Angeles
976   2018-07-03                5.0          12    Active     New York

     Session
8      Night
22     Night
29     Night
215  Morning
228    Night
239  Morning
250    Night
263  Morning
275  Morning
299  Morning
379  Evening
381  Evening
405    Night
442  Evening
491  Morning
516    Night
552  Evening
591  Evening
594  Evening
629  Evening
742  Morning
756  Morning
758  Evening
778  Morning
796    Night
844  Morning
898  Morning
903  Evening
932    Night
937  Morning
976  Morning

In [14]:
# Task 11: Replace all "Inactive" values in the Status column with "Retired"
print("\n# Task 11: Replace 'Inactive' with 'Retired'")
df['Status'] = df['Status'].replace('Inactive', 'Retired')
print(df[['ID', 'Name', 'Status']])

# Task 11: Replace 'Inactive' with 'Retired'
       ID                Name   Status
0       1        Cory Escobar   Active
1       2     Timothy Sanchez  Retired
2       3        Chad Nichols  Retired
3       4  Christine Williams  Retired
4       5        Amber Harris  Retired
..    ...                 ...      ...
995   996       Pamela Reeves   Active
996   997        Todd Johnson  Retired
997   998     Michael Sanchez   Active
998   999       Ashley Taylor  Retired
999  1000         Shawn Scott   Active

[1000 rows x 3 columns]

In [15]:
# Task 12: Add a new column Bonus where values are 10% of the Salary column
print("\n# Task 12: Add a 'Bonus' column (10% of Salary)")
df['Bonus'] = df['Salary'] * 0.1
print(df[['ID', 'Name', 'Salary', 'Bonus']])

# Task 12: Add a 'Bonus' column (10% of Salary)
       ID                Name  Salary  Bonus
0       1        Cory Escobar    5641  564.1
1       2     Timothy Sanchez    4249  424.9
2       3        Chad Nichols    3058  305.8
3       4  Christine Williams    5895  589.5
4       5        Amber Harris    4317  431.7
..    ...                 ...     ...    ...
995   996       Pamela Reeves    7652  765.2
996   997        Todd Johnson    6754  675.4
997   998     Michael Sanchez    5278  527.8
998   999       Ashley Taylor    5437  543.7
999  1000         Shawn Scott    7364  736.4

[1000 rows x 4 columns]

In [16]:
# Task 13: Update Performance Score of employees in "IT" to 5 if it is NaN
print("\n# Task 13: Update NaN Performance Score in 'IT' to 5")
df.loc[(df['Department'] == 'IT') & (df['Performance Score'].isna()), 'Performance Score'] = 5
print(df[['ID', 'Name', 'Department', 'Performance Score']])

# Task 13: Update NaN Performance Score in 'IT' to 5
       ID                Name Department  Performance Score
0       1        Cory Escobar         HR                2.0
1       2     Timothy Sanchez      Sales                2.0
2       3        Chad Nichols      Sales                NaN
3       4  Christine Williams         IT                2.0
4       5        Amber Harris         IT                5.0
..    ...                 ...        ...                ...
995   996       Pamela Reeves      Sales                4.0
996   997        Todd Johnson      Sales                NaN
997   998     Michael Sanchez      Sales                5.0
998   999       Ashley Taylor         IT                4.0
999  1000         Shawn Scott         IT                2.0

[1000 rows x 4 columns]

In [17]:
# Task 14: Modify Experience of employees with less than 2 years to 2
print("\n# Task 14: Modify Experience < 2 to 2")
df.loc[df['Experience'] < 2, 'Experience'] = 2
print(df[['ID', 'Name', 'Experience']])

# Task 14: Modify Experience < 2 to 2
       ID                Name  Experience
0       1        Cory Escobar          16
1       2     Timothy Sanchez          11
2       3        Chad Nichols           2
3       4  Christine Williams          13
4       5        Amber Harris          16
..    ...                 ...         ...
995   996       Pamela Reeves           3
996   997        Todd Johnson          12
997   998     Michael Sanchez           3
998   999       Ashley Taylor           9
999  1000         Shawn Scott           4

[1000 rows x 3 columns]

In [18]:
# Task 15: Normalize the Salary column so that all values are between 0 and 1
print("\n# Task 15: Normalize 'Salary' between 0 and 1")
df['Salary_Normalized'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())
print(df[['ID', 'Name', 'Salary', 'Salary_Normalized']])

# Task 15: Normalize 'Salary' between 0 and 1
       ID                Name  Salary  Salary_Normalized
0       1        Cory Escobar    5641           0.454500
1       2     Timothy Sanchez    4249           0.280020
2       3        Chad Nichols    3058           0.130735
3       4  Christine Williams    5895           0.486337
4       5        Amber Harris    4317           0.288543
..    ...                 ...     ...                ...
995   996       Pamela Reeves    7652           0.706568
996   997        Todd Johnson    6754           0.594009
997   998     Michael Sanchez    5278           0.409000
998   999       Ashley Taylor    5437           0.428930
999  1000         Shawn Scott    7364           0.670469

[1000 rows x 4 columns]

In [19]:
# Task 16: Replace all Location values with "Remote" for employees with Performance Score below 3
print("\n# Task 16: Replace Location with 'Remote' for Performance Score < 3")
df.loc[df['Performance Score'] < 3, 'Location'] = 'Remote'
if 'Location' in df.columns:  # If Location exists in your data
    print(df[['ID', 'Name', 'Performance Score', 'Location']])

# Task 16: Replace Location with 'Remote' for Performance Score < 3
       ID                Name  Performance Score     Location
0       1        Cory Escobar                2.0       Remote
1       2     Timothy Sanchez                2.0       Remote
2       3        Chad Nichols                NaN     New York
3       4  Christine Williams                2.0       Remote
4       5        Amber Harris                5.0     New York
..    ...                 ...                ...          ...
995   996       Pamela Reeves                4.0  Los Angeles
996   997        Todd Johnson                NaN     New York
997   998     Michael Sanchez                5.0     New York
998   999       Ashley Taylor                4.0  Los Angeles
999  1000         Shawn Scott                2.0       Remote

[1000 rows x 4 columns]

In [20]:
# Task 17: Create a new column Experience Level: Junior, Mid, Senior
print("\n# Task 17: Add 'Experience Level' column")
df['Experience Level'] = pd.cut(
    df['Experience'], bins=[0, 5, 10, float('inf')], labels=['Junior', 'Mid', 'Senior']
)
print(df[['ID', 'Name', 'Experience', 'Experience Level']])

# Task 17: Add 'Experience Level' column
       ID                Name  Experience Experience Level
0       1        Cory Escobar          16           Senior
1       2     Timothy Sanchez          11           Senior
2       3        Chad Nichols           2           Junior
3       4  Christine Williams          13           Senior
4       5        Amber Harris          16           Senior
..    ...                 ...         ...              ...
995   996       Pamela Reeves           3           Junior
996   997        Todd Johnson          12           Senior
997   998     Michael Sanchez           3           Junior
998   999       Ashley Taylor           9              Mid
999  1000         Shawn Scott           4           Junior

[1000 rows x 4 columns]

In [21]:
# Task 19: Delete the column "Session" from the DataFrame
print("\n# Task 19: Delete 'Session' column")
# Assuming a column named 'Session' exists in the original dataset
if 'Session' in df.columns:
    df = df.drop(columns=['Session'])
print(df.columns)

# Task 19: Delete 'Session' column
Index(['ID', 'Name', 'Age', 'Gender', 'Department', 'Salary', 'Joining Date',
       'Performance Score', 'Experience', 'Status', 'Location', 'Bonus',
       'Salary_Normalized', 'Experience Level'],
      dtype='object')

In [22]:
# Task 20: Delete rows where Age > 60
print("\n# Task 20: Delete rows where Age > 60")
df = df[df['Age'] <= 60]
print(df[['ID', 'Name', 'Age']])

# Task 20: Delete rows where Age > 60
       ID                Name  Age
0       1        Cory Escobar   48
1       2     Timothy Sanchez   25
2       3        Chad Nichols   57
3       4  Christine Williams   58
4       5        Amber Harris   35
..    ...                 ...  ...
995   996       Pamela Reeves   49
996   997        Todd Johnson   29
997   998     Michael Sanchez   18
998   999       Ashley Taylor   51
999  1000         Shawn Scott   45

[893 rows x 3 columns]

In [23]:
# Task 20: Delete rows where Age > 60
print("\n# Task 20: Delete rows where Age > 60")
df = df[df['Age'] <= 60]
print(df[['ID', 'Name', 'Age']])

# Task 20: Delete rows where Age > 60
       ID                Name  Age
0       1        Cory Escobar   48
1       2     Timothy Sanchez   25
2       3        Chad Nichols   57
3       4  Christine Williams   58
4       5        Amber Harris   35
..    ...                 ...  ...
995   996       Pamela Reeves   49
996   997        Todd Johnson   29
997   998     Michael Sanchez   18
998   999       Ashley Taylor   51
999  1000         Shawn Scott   45

[893 rows x 3 columns]

In [24]:
# Task 21: Add a new column Age Group with values 'Young', 'Middle-aged', or 'Senior'
print("\n# Task 21: Add 'Age Group' column")
df['Age Group'] = pd.cut(
    df['Age'], bins=[0, 30, 50, float('inf')], labels=['Young', 'Middle-aged', 'Senior']
)
print(df[['ID', 'Name', 'Age', 'Age Group']])

# Task 21: Add 'Age Group' column
       ID                Name  Age    Age Group
0       1        Cory Escobar   48  Middle-aged
1       2     Timothy Sanchez   25        Young
2       3        Chad Nichols   57       Senior
3       4  Christine Williams   58       Senior
4       5        Amber Harris   35  Middle-aged
..    ...                 ...  ...          ...
995   996       Pamela Reeves   49  Middle-aged
996   997        Todd Johnson   29        Young
997   998     Michael Sanchez   18        Young
998   999       Ashley Taylor   51       Senior
999  1000         Shawn Scott   45  Middle-aged

[893 rows x 4 columns]

In [25]:
# Task 22: Identify all columns with missing values using isna() method
print("\n# Task 22: Identify columns with missing values")
missing_values = df.isna().sum()
print(missing_values)

# Task 22: Identify columns with missing values
ID                     0
Name                   0
Age                    0
Gender                 0
Department             0
Salary                 0
Joining Date           0
Performance Score    291
Experience             0
Status                 0
Location               0
Bonus                  0
Salary_Normalized      0
Experience Level       0
Age Group              0
dtype: int64

In [26]:
# Task 23: Fill missing values in Performance Score with the average score
print("\n# Task 23: Fill missing 'Performance Score' with average score")
average_score = df['Performance Score'].mean()
df['Performance Score'] = df['Performance Score'].fillna(average_score)
print(df[['ID', 'Name', 'Performance Score']])

# Task 23: Fill missing 'Performance Score' with average score
       ID                Name  Performance Score
0       1        Cory Escobar            2.00000
1       2     Timothy Sanchez            2.00000
2       3        Chad Nichols            3.44186
3       4  Christine Williams            2.00000
4       5        Amber Harris            5.00000
..    ...                 ...                ...
995   996       Pamela Reeves            4.00000
996   997        Todd Johnson            3.44186
997   998     Michael Sanchez            5.00000
998   999       Ashley Taylor            4.00000
999  1000         Shawn Scott            2.00000

[893 rows x 3 columns]

In [27]:
# Task 24: Drop all rows with missing values using dropna()
print("\n# Task 24: Drop rows with missing values")
df = df.dropna()
print(df)

# Task 24: Drop rows with missing values
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Bonus  \
0              2.00000          16   Active       Remote  564.1
1              2.00000          11  Retired       Remote  424.9
2              3.44186           2  Retired     New York  305.8
3              2.00000          13  Retired       Remote  589.5
4              5.00000          16  Retired     New York  431.7
..                 ...         ...      ...          ...    ...
995            4.00000           3   Active  Los Angeles  765.2
996            3.44186          12  Retired     New York  675.4
997            5.00000           3   Active     New York  527.8
998            4.00000           9  Retired  Los Angeles  543.7
999            2.00000           4   Active       Remote  736.4

     Salary_Normalized Experience Level    Age Group
0             0.454500           Senior  Middle-aged
1             0.280020           Senior        Young
2             0.130735           Junior       Senior
3             0.486337           Senior       Senior
4             0.288543           Senior  Middle-aged
..                 ...              ...          ...
995           0.706568           Junior  Middle-aged
996           0.594009           Senior        Young
997           0.409000           Junior        Young
998           0.428930              Mid       Senior
999           0.670469           Junior  Middle-aged

[893 rows x 15 columns]

In [28]:
# Task 25: Replace missing Performance Score with the median, grouped by Department
print("\n# Task 25: Replace missing 'Performance Score' with median by Department")
df['Performance Score'] = df.groupby('Department')['Performance Score'].transform(
    lambda x: x.fillna(x.median())
)
print(df[['ID', 'Name', 'Department', 'Performance Score']])

# Task 25: Replace missing 'Performance Score' with median by Department
       ID                Name Department  Performance Score
0       1        Cory Escobar         HR            2.00000
1       2     Timothy Sanchez      Sales            2.00000
2       3        Chad Nichols      Sales            3.44186
3       4  Christine Williams         IT            2.00000
4       5        Amber Harris         IT            5.00000
..    ...                 ...        ...                ...
995   996       Pamela Reeves      Sales            4.00000
996   997        Todd Johnson      Sales            3.44186
997   998     Michael Sanchez      Sales            5.00000
998   999       Ashley Taylor         IT            4.00000
999  1000         Shawn Scott         IT            2.00000

[893 rows x 4 columns]

In [29]:
# Task 26: Rows where employee is in 'IT' and Age > average Age of IT employees
print("\n# Task 26: Employees in 'IT' with Age > average IT Age")
it_avg_age = df[df['Department'] == 'IT']['Age'].mean()
it_employees = df[(df['Department'] == 'IT') & (df['Age'] > it_avg_age)]
print(it_employees[['ID', 'Name', 'Age', 'Department']])

# Task 26: Employees in 'IT' with Age > average IT Age
       ID                Name  Age Department
3       4  Christine Williams   58         IT
33     34    Mr. Brian Nelson   42         IT
34     35            Lisa Fry   51         IT
41     42      Charles Mccall   58         IT
47     48        Jake Johnson   48         IT
..    ...                 ...  ...        ...
979   980    Crystal Espinoza   55         IT
984   985        Jeffrey Hall   41         IT
986   987     Melissa Bradley   39         IT
998   999       Ashley Taylor   51         IT
999  1000         Shawn Scott   45         IT

[150 rows x 4 columns]

In [30]:
# Task 27: Identify rows with duplicate Name and Joining Date combinations, and remove duplicates
print("\n# Task 27: Remove duplicates by 'Name' and 'Joining Date'")
df = df.drop_duplicates(subset=['Name', 'Joining Date'])
print(df)

# Task 27: Remove duplicates by 'Name' and 'Joining Date'
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Bonus  \
0              2.00000          16   Active       Remote  564.1
1              2.00000          11  Retired       Remote  424.9
2              3.44186           2  Retired     New York  305.8
3              2.00000          13  Retired       Remote  589.5
4              5.00000          16  Retired     New York  431.7
..                 ...         ...      ...          ...    ...
995            4.00000           3   Active  Los Angeles  765.2
996            3.44186          12  Retired     New York  675.4
997            5.00000           3   Active     New York  527.8
998            4.00000           9  Retired  Los Angeles  543.7
999            2.00000           4   Active       Remote  736.4

     Salary_Normalized Experience Level    Age Group
0             0.454500           Senior  Middle-aged
1             0.280020           Senior        Young
2             0.130735           Junior       Senior
3             0.486337           Senior       Senior
4             0.288543           Senior  Middle-aged
..                 ...              ...          ...
995           0.706568           Junior  Middle-aged
996           0.594009           Senior        Young
997           0.409000           Junior        Young
998           0.428930              Mid       Senior
999           0.670469           Junior  Middle-aged

[893 rows x 15 columns]

In [31]:
# Task 28: Remove rows where Experience > Age - 18
print("\n# Task 28: Remove rows where Experience > Age - 18")
df = df[df['Experience'] <= (df['Age'] - 18)]
print(df[['ID', 'Name', 'Age', 'Experience']])

# Task 28: Remove rows where Experience > Age - 18
       ID                Name  Age  Experience
0       1        Cory Escobar   48          16
2       3        Chad Nichols   57           2
3       4  Christine Williams   58          13
4       5        Amber Harris   35          16
5       6         Ashley Howe   29           6
..    ...                 ...  ...         ...
990   991        Amy Johnston   53           8
993   994       Brandon Bruce   31          12
995   996       Pamela Reeves   49           3
998   999       Ashley Taylor   51           9
999  1000         Shawn Scott   45           4

[659 rows x 4 columns]

In [32]:
# Task 29: Sort the DataFrame by Salary in descending order
print("\n# Task 29: Sort by Salary in descending order")
df = df.sort_values(by='Salary', ascending=False)
print(df[['ID', 'Name', 'Salary']])

# Task 29: Sort by Salary in descending order
      ID                Name  Salary
811  812        Jesse Miller    9993
531  532  Jeffrey Williamson    9988
937  938       Gary Mitchell    9963
908  909       Sara Martinez    9951
120  121       David Hampton    9941
..   ...                 ...     ...
426  427      Patricia Scott    2041
882  883      Jaclyn Collins    2029
76    77       Victor Nelson    2025
473  474        David Potter    2016
906  907   Christina Carlson    2015

[659 rows x 3 columns]

In [33]:
# Task 30: Sort the DataFrame by Department and then by Joining Date in ascending order
print("\n# Task 30: Sort by Department and then by Joining Date")
df = df.sort_values(by=['Department', 'Joining Date'])
print(df[['ID', 'Name', 'Department', 'Joining Date']])

# Task 30: Sort by Department and then by Joining Date
      ID               Name Department Joining Date
514  515  Taylor Williamson         HR   2015-03-10
11    12  Rodney Richardson         HR   2015-03-14
7      8       Amanda Baker         HR   2015-04-01
677  678    Michelle Durham         HR   2015-04-25
0      1       Cory Escobar         HR   2015-05-03
..   ...                ...        ...          ...
405  406      Heather Scott      Sales   2024-08-18
864  865     Jessica Garcia      Sales   2024-08-23
819  820         Amber Ward      Sales   2024-09-19
141  142  Matthew Gutierrez      Sales   2024-10-22
169  170      George Bowers      Sales   2024-12-07

[659 rows x 4 columns]

In [34]:
# Task 31: Rank all employees by Salary within their Department and add the rank as a new column
print("\n# Task 31: Rank employees by Salary within each Department")
df['Salary Rank'] = df.groupby('Department')['Salary'].rank(ascending=False)
print(df[['ID', 'Name', 'Department', 'Salary', 'Salary Rank']])

# Task 31: Rank employees by Salary within each Department
      ID               Name Department  Salary  Salary Rank
514  515  Taylor Williamson         HR    9293         15.0
11    12  Rodney Richardson         HR    6908         81.0
7      8       Amanda Baker         HR    6285        103.0
677  678    Michelle Durham         HR    5900        110.0
0      1       Cory Escobar         HR    5641        114.0
..   ...                ...        ...     ...          ...
405  406      Heather Scott      Sales    9505         14.0
864  865     Jessica Garcia      Sales    8619         35.0
819  820         Amber Ward      Sales    7880         59.0
141  142  Matthew Gutierrez      Sales    5883        115.0
169  170      George Bowers      Sales    6041        111.0

[659 rows x 5 columns]

In [35]:
# Task 32: Sort the dataset by Experience in descending order, break ties using Performance Score in ascending order
print("\n# Task 32: Sort by Experience (desc) and Performance Score (asc)")
df = df.sort_values(by=['Experience', 'Performance Score'], ascending=[False, True])
print(df[['ID', 'Name', 'Experience', 'Performance Score']])

# Task 32: Sort by Experience (desc) and Performance Score (asc)
      ID                        Name  Experience  Performance Score
538  539              Brandon Church          20                1.0
355  356              Laura Castillo          20                1.0
402  403               Briana Martin          20                1.0
828  829              Michael Snyder          20                1.0
529  530                  Katie Vega          20                2.0
..   ...                         ...         ...                ...
143  144                 Dana Potter           2                5.0
987  988              Danielle Brown           2                5.0
364  365  Mrs. Jacqueline Woodard MD           2                5.0
228  229             Christie Warren           2                5.0
491  492     Dr. Jacob Castaneda DVM           2                5.0

[659 rows x 4 columns]

In [36]:
# Task 33: Create a new DataFrame containing only employees in 'HR' with Salary > 5000
print("\n# Task 33: Create DataFrame with employees in 'HR' and Salary > 5000")
hr_high_salary = df[(df['Department'] == 'HR') & (df['Salary'] > 5000)]
print(hr_high_salary[['ID', 'Name', 'Salary', 'Department']])

# Task 33: Create DataFrame with employees in 'HR' and Salary > 5000
      ID                   Name  Salary Department
538  539         Brandon Church    8388         HR
529  530             Katie Vega    7002         HR
330  331              Juan Dean    6830         HR
870  871            Nicole Cook    8495         HR
165  166           Caleb Coffey    6194         HR
..   ...                    ...     ...        ...
119  120         Heidi Franklin    7187         HR
513  514  Miss Alyssa Perez DDS    8297         HR
599  600          Stephen Weber    7375         HR
643  644          Rebecca Avery    6918         HR
732  733              Jay Evans    8147         HR

[128 rows x 4 columns]

In [37]:
# Task 34: Filter out all rows where the Location is 'Chicago'
print("\n# Task 34: Filter out rows where Location is 'Chicago'")
df_filtered_location = df[df['Location'] != 'Chicago']
print(df_filtered_location[['ID', 'Name', 'Location']])

# Task 34: Filter out rows where Location is 'Chicago'
      ID                     Name     Location
538  539           Brandon Church       Remote
355  356           Laura Castillo       Remote
402  403            Briana Martin       Remote
828  829           Michael Snyder       Remote
529  530               Katie Vega       Remote
..   ...                      ...          ...
709  710              Jacob Woods     New York
651  652           Julian Maxwell  Los Angeles
438  439         Mrs. Lisa Suarez  Los Angeles
143  144              Dana Potter     New York
491  492  Dr. Jacob Castaneda DVM  Los Angeles

[492 rows x 3 columns]

In [38]:
# Task 35: Delete all rows where the Performance Score is below 2
print("\n# Task 35: Delete rows where Performance Score < 2")
df = df[df['Performance Score'] >= 2]
print(df[['ID', 'Name', 'Performance Score']])

# Task 35: Delete rows where Performance Score < 2
      ID                        Name  Performance Score
529  530                  Katie Vega            2.00000
808  809             Matthew Bonilla            2.00000
854  855                   Amy Heath            2.00000
765  766                 Steve Smith            2.00000
287  288               Michele Roman            3.44186
..   ...                         ...                ...
143  144                 Dana Potter            5.00000
987  988              Danielle Brown            5.00000
364  365  Mrs. Jacqueline Woodard MD            5.00000
228  229             Christie Warren            5.00000
491  492     Dr. Jacob Castaneda DVM            5.00000

[584 rows x 3 columns]

In [39]:
# Task 36: Find the average Salary for each Department
print("\n# Task 36: Average Salary for each Department")
avg_salary_by_dept = df.groupby('Department')['Salary'].mean()
print(avg_salary_by_dept)

# Task 36: Average Salary for each Department
Department
HR       5955.85000
IT       5903.08867
Sales    5843.18408
Name: Salary, dtype: float64

In [40]:
# Task 37: Calculate the total Salary of all employees grouped by Status
print("\n# Task 37: Total Salary grouped by Status")
total_salary_by_status = df.groupby('Status')['Salary'].sum()
print(total_salary_by_status)

# Task 37: Total Salary grouped by Status
Status
Active     1709221
Retired    1735639
Name: Salary, dtype: int64

In [41]:
# Task 38: Find the maximum Performance Score for employees in each Location
print("\n# Task 38: Maximum Performance Score for each Location")
max_performance_by_location = df.groupby('Location')['Performance Score'].max()
print(max_performance_by_location)

# Task 38: Maximum Performance Score for each Location
Location
Chicago        5.0
Los Angeles    5.0
New York       5.0
Remote         2.0
Name: Performance Score, dtype: float64

In [42]:
# Task 40: Find the department with the highest average Performance Score
print("\n# Task 40: Department with the highest average Performance Score")
avg_perf_by_dept = df.groupby('Department')['Performance Score'].mean()
highest_perf_dept = avg_perf_by_dept.idxmax()
print(f"The department with the highest average Performance Score is: {highest_perf_dept}")

# Task 40: Department with the highest average Performance Score
The department with the highest average Performance Score is: IT

In [43]:
# Task 39: Calculate the total Salary paid to employees who joined in each year
print("\n# Task 39: Total Salary paid to employees who joined in each year")
# Extract the year from the 'Joining Date' column
df['Joining Year'] = pd.to_datetime(df['Joining Date']).dt.year
# Group by the 'Joining Year' and calculate the total salary for each year
total_salary_by_year = df.groupby('Joining Year')['Salary'].sum()
print(total_salary_by_year)

# Task 39: Total Salary paid to employees who joined in each year
Joining Year
2014     15135
2015    275743
2016    370821
2017    313615
2018    392152
2019    325801
2020    360210
2021    372695
2022    289763
2023    423272
2024    305653
Name: Salary, dtype: int64

In [44]:
# Task 41: Count the number of employees in each Location grouped by their Session
print("\n# Task 41: Count the number of employees in each Location grouped by Session")
# Assuming 'Session' is a column, group by 'Location' and 'Session', then count the number of employees
if 'Session' in df.columns:
    count_by_location_session = df.groupby(['Location', 'Session']).size()
    print(count_by_location_session)

# Task 41: Count the number of employees in each Location grouped by Session

In [45]:
# Task 42: Group employees by Status and calculate the sum, mean, and standard deviation of their Salary
print("\n# Task 42: Group by Status and calculate sum, mean, and std of Salary")
salary_stats_by_status = df.groupby('Status')['Salary'].agg(['sum', 'mean', 'std'])
print(salary_stats_by_status)

# Task 42: Group by Status and calculate sum, mean, and std of Salary
             sum         mean          std
Status
Active   1709221  5873.611684  2318.058399
Retired  1735639  5923.682594  2359.371700

In [46]:
# Task 43: Use the apply() method to create a new column 'Monthly Salary' by dividing the Salary by 12
print("\n# Task 43: Create 'Monthly Salary' column by dividing Salary by 12")
df['Monthly Salary'] = df['Salary'].apply(lambda x: x / 12)
print(df[['ID', 'Name', 'Salary', 'Monthly Salary']])

# Task 43: Create 'Monthly Salary' column by dividing Salary by 12
      ID                        Name  Salary  Monthly Salary
529  530                  Katie Vega    7002      583.500000
808  809             Matthew Bonilla    9092      757.666667
854  855                   Amy Heath    6897      574.750000
765  766                 Steve Smith    3414      284.500000
287  288               Michele Roman    3162      263.500000
..   ...                         ...     ...             ...
143  144                 Dana Potter    6368      530.666667
987  988              Danielle Brown    5605      467.083333
364  365  Mrs. Jacqueline Woodard MD    5988      499.000000
228  229             Christie Warren    9139      761.583333
491  492     Dr. Jacob Castaneda DVM    9181      765.083333

[584 rows x 4 columns]

In [49]:
# Task 45: Create a second dataset containing Department and Budget. Perform an inner join with the original dataset
print("\n# Task 45: Perform an inner join with Department and Budget dataset")
budget_data = {
    'Department': ['HR', 'Sales', 'IT'],
    'Budget': [50000, 60000, 70000]
}
budget_df = pd.DataFrame(budget_data)
df_with_budget = pd.merge(df, budget_df, on='Department', how='inner')
print(df_with_budget[['ID', 'Name', 'Department', 'Salary', 'Budget']])

# Task 45: Perform an inner join with Department and Budget dataset
      ID                        Name Department  Salary  Budget
0    530                  Katie Vega         HR    7002   50000
1    809             Matthew Bonilla         IT    9092   70000
2    855                   Amy Heath      Sales    6897   60000
3    766                 Steve Smith      Sales    3414   60000
4    288               Michele Roman         HR    3162   50000
..   ...                         ...        ...     ...     ...
579  144                 Dana Potter         IT    6368   70000
580  988              Danielle Brown         IT    5605   70000
581  365  Mrs. Jacqueline Woodard MD      Sales    5988   60000
582  229             Christie Warren      Sales    9139   60000
583  492     Dr. Jacob Castaneda DVM      Sales    9181   60000

[584 rows x 5 columns]

In [53]:
# Task 46: Merge the dataset with another dataset that includes additional information about employee ID and recent Projects
print("\n# Task 46: Merge with dataset containing Employee ID and Projects")
project_data = {
    'ID': [1, 2, 3, 4, 5],
    'Recent Projects': ['Project A', 'Project B', 'Project C', 'Project D', 'Project E']
}
project_df = pd.DataFrame(project_data)
df_with_projects = pd.merge(df, project_df, on='ID', how='left')
print(df_with_projects[['ID', 'Name', 'Recent Projects']])

# Task 46: Merge with dataset containing Employee ID and Projects
      ID                        Name Recent Projects
0    530                  Katie Vega             NaN
1    809             Matthew Bonilla             NaN
2    855                   Amy Heath             NaN
3    766                 Steve Smith             NaN
4    288               Michele Roman             NaN
..   ...                         ...             ...
579  144                 Dana Potter             NaN
580  988              Danielle Brown             NaN
581  365  Mrs. Jacqueline Woodard MD             NaN
582  229             Christie Warren             NaN
583  492     Dr. Jacob Castaneda DVM             NaN

[584 rows x 3 columns]

In [54]:
# Task 47: Perform a left join with a dataset containing Department and Team Lead details, adding Team Lead to the DataFrame
print("\n# Task 47: Left join with Team Lead dataset")
team_lead_data = {
    'Department': ['HR', 'Sales', 'IT'],
    'Team Lead': ['Alice', 'Bob', 'Charlie']
}
team_lead_df = pd.DataFrame(team_lead_data)
df_with_team_lead = pd.merge(df, team_lead_df, on='Department', how='left')
print(df_with_team_lead[['ID', 'Name', 'Department', 'Team Lead']])

# Task 47: Left join with Team Lead dataset
      ID                        Name Department Team Lead
0    530                  Katie Vega         HR     Alice
1    809             Matthew Bonilla         IT   Charlie
2    855                   Amy Heath      Sales       Bob
3    766                 Steve Smith      Sales       Bob
4    288               Michele Roman         HR     Alice
..   ...                         ...        ...       ...
579  144                 Dana Potter         IT   Charlie
580  988              Danielle Brown         IT   Charlie
581  365  Mrs. Jacqueline Woodard MD      Sales       Bob
582  229             Christie Warren      Sales       Bob
583  492     Dr. Jacob Castaneda DVM      Sales       Bob

[584 rows x 4 columns]

In [55]:
# Task 48: Create a DataFrame with employee ID and Project Count, then merge it with the original dataset. Calculate the average Salary per project
print("\n# Task 48: Merge with Project Count DataFrame and calculate average Salary per project")
project_count_data = {
    'ID': [1, 2, 3, 4, 5],
    'Project Count': [3, 2, 1, 4, 5]
}
project_count_df = pd.DataFrame(project_count_data)
df_with_project_count = pd.merge(df, project_count_df, on='ID', how='left')
df_with_project_count['Average Salary per Project'] = df_with_project_count['Salary'] / df_with_project_count['Project Count']
print(df_with_project_count[['ID', 'Name', 'Project Count', 'Average Salary per Project']])

# Task 48: Merge with Project Count DataFrame and calculate average Salary per project
      ID                        Name  Project Count  \
0    530                  Katie Vega            NaN
1    809             Matthew Bonilla            NaN
2    855                   Amy Heath            NaN
3    766                 Steve Smith            NaN
4    288               Michele Roman            NaN
..   ...                         ...            ...
579  144                 Dana Potter            NaN
580  988              Danielle Brown            NaN
581  365  Mrs. Jacqueline Woodard MD            NaN
582  229             Christie Warren            NaN
583  492     Dr. Jacob Castaneda DVM            NaN

     Average Salary per Project
0                           NaN
1                           NaN
2                           NaN
3                           NaN
4                           NaN
..                          ...
579                         NaN
580                         NaN
581                         NaN
582                         NaN
583                         NaN

[584 rows x 4 columns]

In [56]:
# Task 49: Calculate the percentage increase in Salary for each employee compared to the average Salary in their Department
print("\n# Task 49: Calculate percentage increase in Salary compared to average Salary in their Department")
department_avg_salary = df.groupby('Department')['Salary'].transform('mean')
df['Salary Percentage Increase'] = ((df['Salary'] - department_avg_salary) / department_avg_salary) * 100
print(df[['ID', 'Name', 'Department', 'Salary', 'Salary Percentage Increase']])

# Task 49: Calculate percentage increase in Salary compared to average Salary in their Department
      ID                        Name Department  Salary  \
529  530                  Katie Vega         HR    7002
808  809             Matthew Bonilla         IT    9092
854  855                   Amy Heath      Sales    6897
765  766                 Steve Smith      Sales    3414
287  288               Michele Roman         HR    3162
..   ...                         ...        ...     ...
143  144                 Dana Potter         IT    6368
987  988              Danielle Brown         IT    5605
364  365  Mrs. Jacqueline Woodard MD      Sales    5988
228  229             Christie Warren      Sales    9139
491  492     Dr. Jacob Castaneda DVM      Sales    9181

     Salary Percentage Increase
529                   17.565083
808                   54.021064
854                   18.034960
765                  -41.572951
287                  -46.909341
..                          ...
143                    7.875730
987                   -5.049707
364                    2.478373
228                   56.404451
491                   57.123238

[584 rows x 5 columns]

In [57]:
# Task 50: Print "Thanks"
print("\n# Task 50: Print 'Thanks'")
print("Thanks")

# Task 50: Print 'Thanks'
Thanks